In [1]:
print("Hello World")

Hello World

In [2]:
print("Latha")

Latha

In [8]:
Print("latha")  # case sensitive

NameError: name 'Print' is not defined

In [9]:
print(latha) # inverted comma is missing

NameError: name 'latha' is not defined

In [11]:
print(20.5)

20.5

In [12]:
print('latha')

latha

### String should be enclosed with ''
### Python is case-sensitive

In [13]:
x=1
type(x)

int

In [14]:
x=1.0
type(x)

float

In [15]:
x=ml
type(x)

NameError: name 'ml' is not defined

In [16]:
x='ml'
type(x)

str

In [17]:
x=True
type(x)

bool

In [18]:
y=False
type(y)

bool

In [23]:
### List
mylist=[11,2,3.5,4,5,6,'hi','hello']
mylist

[11, 2, 3.5, 4, 5, 6, 'hi', 'hello']

In [24]:
type(mylist)

list

In [26]:
mylist[3]

4

In [27]:
mylist[10]

IndexError: list index out of range

In [28]:
mylist[0:2]

[11, 2]

In [29]:
mylist[0]=15
mylist

[15, 2, 3.5, 4, 5, 6, 'hi', 'hello']

###  List->Square brackets
### Mutable->Make changes

In [30]:
x=(1,2,3,4,5,"hi",12.4,"hello")
x

(1, 2, 3, 4, 5, 'hi', 12.4, 'hello')

In [31]:
type(x)

tuple

In [32]:
x[0]

1

In [33]:
x[5]

'hi'

In [34]:
x[2:4]

(3, 4)

In [35]:
x[0]=10

TypeError: 'tuple' object does not support item assignment

### Tuple->Paranthesis()
### Immutable-cannot change

### Cardiogoodfitness casestudy

### dhkvcghjkadvkjhdkjvh

#### dukvjksjdhvlshdk

##### dgcchjgahvgjka

# ghgchghcg

In [38]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [39]:
df=pd.read_csv("CardioGoodFitness-1.csv")

In [40]:
df.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [41]:
df.tail()

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [44]:
df.sample(10)

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
172,TM798,34,Male,16,Single,5,5,92131,150
124,TM498,33,Female,18,Single,3,4,47754,74
149,TM798,24,Male,16,Single,5,5,49801,160
18,TM195,23,Female,16,Single,4,3,38658,113
10,TM195,22,Male,14,Single,3,3,36384,85
97,TM498,25,Female,14,Partnered,2,3,45480,85
144,TM798,23,Female,18,Single,5,4,53536,100
135,TM498,40,Female,16,Partnered,3,3,61398,85
125,TM498,34,Female,16,Partnered,4,3,64809,95
14,TM195,23,Male,16,Partnered,3,1,38658,47

In [45]:
df.shape

(180, 9)

In [46]:
df.describe()

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [47]:
df.describe(include="all")

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
count,180,180.000000,180,180.000000,180,180.000000,180.000000,180.000000,180.000000
unique,3,NaN,2,NaN,2,NaN,NaN,NaN,NaN
top,TM195,NaN,Male,NaN,Partnered,NaN,NaN,NaN,NaN
freq,80,NaN,104,NaN,107,NaN,NaN,NaN,NaN
mean,NaN,28.788889,NaN,15.572222,NaN,3.455556,3.311111,53719.577778,103.194444
std,NaN,6.943498,NaN,1.617055,NaN,1.084797,0.958869,16506.684226,51.863605
min,NaN,18.000000,NaN,12.000000,NaN,2.000000,1.000000,29562.000000,21.000000
25%,NaN,24.000000,NaN,14.000000,NaN,3.000000,3.000000,44058.750000,66.000000
50%,NaN,26.000000,NaN,16.000000,NaN,3.000000,3.000000,50596.500000,94.000000
75%,NaN,33.000000,NaN,16.000000,NaN,4.000000,4.000000,58668.000000,114.750000
max,NaN,50.000000,NaN,21.000000,NaN,7.000000,5.000000,104581.000000,360.000000

In [50]:
df.dtypes

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB